RafaelLaya/tm4c1294ncpdt_drivers/drivers/tm4c1294ncpdt/inc/tm4c1294ncpdt_uart.h
#pragma once

#include "tm4c1294ncpdt.h"

typedef struct {
  uint32_t DataLen;                 
  uint8_t *pData;   
  uint8_t Status;                   /* Value from @UART_PollingStatus */
} UART_RcvPolling_t;

typedef struct {
  uint32_t ClockFreq;               /* Frequency of the UART Clock in Hz */ 
  uint32_t BaudRate;                /* Desired Baud Rate in Hz */
  uint8_t HighSpeedCommand;         /* ENABLE or DISABLE */
  uint8_t Parity;                   /* Value from @UART_Parity */
  uint8_t WordLen;                  /* Value from @UART_WordLen */
  uint8_t StopBits;                 /* Value from @UART_StopLen */
  uint8_t BreakCommand;             /* ENABLE or DISABLE */
  uint8_t HardwareCTS;              /* ENABLE or DISABLE */
  uint8_t HardwareRTS;              /* ENABLE or DISABLE */
  uint8_t LoopbackCommand;          /* ENABLE or DISABLE */
  uint8_t FifoCommand;              /* ENABLE or DISABLE */
  uint8_t ClockSource;              /* Value from @UART_ClockSource */
} UART_Config_t;

typedef struct {
  uint8_t *pData;
  uint32_t DataLen;
  uint8_t Status;                   /* Value from @UART_MSGStatus */
} UART_Buffer_t;

typedef struct {
  UART_RegDef_t *pUART;
  UART_Buffer_t TxBuffer;
  UART_Buffer_t RxBuffer;
} UART_Handle_t;

/* @UART_MSGStatus */
#define UART_MSGStatus_BUSY                 1U
#define UART_MSGStatus_READY                2U

/* @UART_TxCallbackEvents */
#define UART_TxCallbackEvents_Finished        1U

/* @UART_RxCallbackEvents */
#define UART_RxCallbackEvents_Finished          1U
#define UART_RxCallbackEvents_OverrunErr        2U
#define UART_RxCallbackEvents_FramingErr        3U
#define UART_RxCallbackEvents_BreakErr          4U
#define UART_RxCallbackEvents_ParityErr         5U

/* @UART_PollingStatus */
#define UART_PollingRcvStatus_Success         0x1U
#define UART_PollingRcvStatus_OverrunErr      0x2U
#define UART_PollingRcvStatus_FramingErr      0x3U
#define UART_PollingRcvStatus_BreakErr        0x4U
#define UART_PollingRcvStatus_ParityErr       0x5U

/* @UART_ClockSource */
#define UART_ClockSource_SYSCLK               0x0U
#define UART_ClockSource_ALTCLK               0x5U

/* @UART_DMA */
#define UART_DMA_Enable                       0x1U
#define UART_DMA_Transmit                     0x2U
#define UART_DMA_Error                        0x4U

/* @UART_ITReadPos */
#define UART_ReadITPos_TransmitDMA            17U
#define UART_ReadITPos_ReceiveDMA             16U
#define UART_ReadITPos_9BitMode               12U
#define UART_ReadITPos_EndOfTransmission      11U
#define UART_ReadITPos_OverrunError           10U
#define UART_ReadITPos_BreakError             9U
#define UART_ReadITPos_ParityError            8U
#define UART_ReadITPos_FramingError           7U
#define UART_ReadITPos_ReceiveTimeout         6U
#define UART_ReadITPos_Transmit               5U
#define UART_ReadITPos_Receive                4U
#define UART_ReadITPos_DataSetReady           3U
#define UART_ReadITPos_DataCarrierDetect      2U
#define UART_ReadITPos_ClearToSend            1U
#define UART_ReadITPos_RingIndicatir          0U

/* @UART_IRQConfig */
#define UART_IRQConfig_RingIndicator              0x1U
#define UART_IRQConfig_ClearToSend                0x2U
#define UART_IRQConfig_DataCarrierDetect          0x4U
#define UART_IRQConfig_DataSetReady               0x8U
#define UART_IRQConfig_Receive                    0x10U
#define UART_IRQConfig_Transmit                   0x20U
#define UART_IRQConfig_ReceiveTimeout             0x40U
#define UART_IRQConfig_FramingError               0x80U
#define UART_IRQConfig_ParityError                0x100U
#define UART_IRQConfig_BreakError                 0x200U
#define UART_IRQConfig_OverrunError               0x400U
#define UART_IRQConfig_EndOfTransmission          0x800U
#define UART_IRQConfig_9BitMode                   0x1000U
#define UART_IRQConfig_ReceiveDMA                 0x10000U
#define UART_IRQConfig_TransmitDMA                0x20000U
#define UART_IRQConfig_All                        0x31FFFU

/* @UART_ITMask */
#define UART_ITMask_RingIndicator              0x1U
#define UART_ITMask_ClearToSend                0x2U
#define UART_ITMask_DataCarrierDetect          0x4U
#define UART_ITMask_DataSetReady               0x8U
#define UART_ITMask_Receive                    0x10U
#define UART_ITMask_Transmit                   0x20U
#define UART_ITMask_ReceiveTimeout             0x40U
#define UART_ITMask_FramingError               0x80U
#define UART_ITMask_ParityError                0x100U
#define UART_ITMask_BreakError                 0x200U
#define UART_ITMask_OverrunError               0x400U
#define UART_ITMask_EndOfTransmission          0x800U
#define UART_ITMask_9BitMode                   0x1000U
#define UART_ITMask_ReceiveDMA                 0x10000U
#define UART_ITMask_TransmitDMA                0x20000U
#define UART_ITMask_All                        0x31FFFU

/* @UART_RxTriggerLevel */
#define UART_RxTriggerLevel_OneEight              0x0U
#define UART_RxTriggerLevel_OneQuarter            0x1U
#define UART_RxTriggerLevel_OneHalf               0x2U
#define UART_RxTriggerLevel_ThreeQuarters         0x3U
#define UART_RxTriggerLevel_SevenEights           0x4U

/* @UART_TxTriggerLevel */
#define UART_TxTriggerLevel_SevenEights         0x0U
#define UART_TxTriggerLevel_ThreeQuarters       0x1U
#define UART_TxTriggerLevel_OneHalf             0x2U
#define UART_TxTriggerLevel_OneQuarter          0x3U
#define UART_TxTriggerLevel_OneEight            0x4U

/* @UART_StopLen */
#define UART_StopLen_1          1U
#define UART_StopLen_2          2U

/* @UART_WordLen */
#define UART_WordLen_5          0x0U
#define UART_WordLen_6          0x1U
#define UART_WordLen_7          0x2U
#define UART_WordLen_8          0x3U

/* @UART_Parity */
#define UART_Parity_Even          1U
#define UART_Parity_Odd           2U
#define UART_Parity_Stick0        3U
#define UART_Parity_Stick1        4U
#define UART_Parity_Disabled      5U

/* @UART_Error */
#define UART_Error_Framing       0U
#define UART_Error_Parity        1U
#define UART_Error_Break         2U
#define UART_Error_Overrun       3U

/* @UART_StatusFlag */
#define UART_StatusFlag_Ring                    8U
#define UART_StatusFlag_TxFifoEmpty             7U
#define UART_StatusFlag_RxFifoFull              6U
#define UART_StatusFlag_TxFifoFull              5U
#define UART_StatusFlag_RxFifoEmpty             4U
#define UART_StatusFlag_Busy                    3U
#define UART_StatusFlag_DataCarrierDetect       2U
#define UART_StatusFlag_DataCarrierReady        1U
#define UART_StatusFlag_ClearToSend             0U         

/* @UART_DR */
#define UART_DR_OVERRUN_POS           11U
#define UART_DR_BREAK_POS             10U
#define UART_DR_PARITY_POS            9U
#define UART_DR_FRAMING_POS           8U

